Revit 2027 API
RebarShapeMultiplanarDefinition.IsStartConnectorPresent Property
 Whether a perpendicular segment is constructed from the start of the 2D shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsStartConnectorPresent { get; }
Public ReadOnly Property IsStartConnectorPresent As Boolean
	Get
public:
property bool IsStartConnectorPresent {
	bool get ();
}
member IsStartConnectorPresent : bool with get
Property Value
Boolean
See Also
Reference
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace